function getRandomArbitrary(min, max) {
    return Math.floor(Math.random() * (max - min) + min);
}
let array = [
    {
        Name: 'آدم',
    },
    {
        Name: 'آسر',
    },
    {
        Name: 'أبد',
    },
    {
        Name: 'أبدع',
    },
    {
        Name: 'أبره',
    },
    {
        Name: 'أبسل',
    },
    {
        Name: 'أبسم',
    },
    {
        Name: 'أبشر',
    },
    {
        Name: 'أبلج',
    },
    {
        Name: 'أبي',
    },
    {
        Name: 'أجاد',
    },
    {
        Name: 'أجزل',
    },
    {
        Name: 'أجمل',
    },
    {
        Name: 'أجوب',
    },
    {
        Name: 'أجود',
    },
    {
        Name: 'أحسب',
    },
    {
        Name: 'أحسن',
    },
    {
        Name: 'أحشم',
    },
    {
        Name: 'أحمد',
    },
    {
        Name: 'أحيد',
    },
    {
        Name: 'أخزم',
    },
    {
        Name: 'أخير',
    },
    {
        Name: 'أخيل',
    },
    {
        Name: 'أُدد',
    },
    {
        Name: 'أدرد',
    },
    {
        Name: 'أدرم',
    },
    {
        Name: 'أدغم',
    },
    {
        Name: 'أدلم',
    },
    {
        Name: 'أدهم',
    },
    {
        Name: 'أديب',
    },
    {
        Name: 'أربد',
    },
    {
        Name: 'أرجح',
    },
    {
        Name: 'أرجوان',
    },
    {
        Name: 'أرحب',
    },
    {
        Name: 'أرحم',
    },
    {
        Name: 'أرسلان',
    },
    {
        Name: 'أرشد',
    },
    {
        Name: 'أرغد',
    },
    {
        Name: 'أرقم',
    },
    {
        Name: 'أركان',
    },
    {
        Name: 'أريج',
    },
    {
        Name: 'أزهد',
    },
    {
        Name: 'أزهر',
    },
    {
        Name: 'أسامة',
    },
    {
        Name: 'أسد',
    },
    {
        Name: 'أسعد',
    },
    {
        Name: 'أسلع',
    },
    {
        Name: 'أسلم',
    },
    {
        Name: 'أسمح',
    },
    {
        Name: 'أسهم',
    },
    {
        Name: 'أسيد',
    },
    {
        Name: 'أشرف',
    },
    {
        Name: 'أشهم',
    },
    {
        Name: 'أصلان',
    },
    {
        Name: 'أعز',
    },
    {
        Name: 'أغلب',
    },
    {
        Name: 'أفخر',
    },
    {
        Name: 'أفخم',
    },
    {
        Name: 'أفصح',
    },
    {
        Name: 'أفضل',
    },
    {
        Name: 'أفقه',
    },
    {
        Name: 'أكثم',
    },
    {
        Name: 'أكرم',
    },
    {
        Name: 'أكمل',
    },
    {
        Name: 'ألمع',
    },
    {
        Name: 'ألمعي',
    },
    {
        Name: 'أليف',
    },
    {
        Name: 'أماثل',
    },
    {
        Name: 'أمجد',
    },
    {
        Name: 'أمية',
    },
    {
        Name: 'أمير',
    },
    {
        Name: 'أمين',
    },
    {
        Name: 'أنجب',
    },
    {
        Name: 'أنجح',
    },
    {
        Name: 'أنس',
    },
    {
        Name: 'أنف',
    },
    {
        Name: 'أنوار',
    },
    {
        Name: 'أنور',
    },
    {
        Name: 'أنوس',
    },
    {
        Name: 'أنيس',
    },
    {
        Name: 'أهيف',
    },
    {
        Name: 'أهيم',
    },
    {
        Name: 'أوس',
    },
    {
        Name: 'أويس',
    },
    {
        Name: 'أيهم',
    },
    {
        Name: 'أيوب',
    },
    {
        Name: 'إبراهيم',
    },
    {
        Name: 'إحسان',
    },
    {
        Name: 'إدام',
    },
    {
        Name: 'إدريس',
    },
    {
        Name: 'إسحاق',
    },
    {
        Name: 'إسماعيل',
    },
    {
        Name: 'إعجاز',
    },
    {
        Name: 'إكليل',
    },
    {
        Name: 'إلفي',
    },
    {
        Name: 'إلياس',
    },
    {
        Name: 'إمام',
    },
    {
        Name: 'إياس',
    },
    {
        Name: 'إيمان',
    },
    {
        Name: 'إيهاب',
    },
    {
        Name: 'ابد',
    },
    {
        Name: 'ابدع',
    },
    {
        Name: 'ابراهيم',
    },
    {
        Name: 'ابره',
    },
    {
        Name: 'ابسل',
    },
    {
        Name: 'ابسم',
    },
    {
        Name: 'ابشر',
    },
    {
        Name: 'ابلج',
    },
    {
        Name: 'ابي',
    },
    {
        Name: 'اجاد',
    },
    {
        Name: 'اجزل',
    },
    {
        Name: 'اجمل',
    },
    {
        Name: 'اجوب',
    },
    {
        Name: 'اجود',
    },
    {
        Name: 'احسان',
    },
    {
        Name: 'احسب',
    },
    {
        Name: 'احسن',
    },
    {
        Name: 'احشم',
    },
    {
        Name: 'احمد',
    },
    {
        Name: 'احيد',
    },
    {
        Name: 'اخزم',
    },
    {
        Name: 'اخير',
    },
    {
        Name: 'اخيل',
    },
    {
        Name: 'ادام',
    },
    {
        Name: 'اُدد',
    },
    {
        Name: 'ادرد',
    },
    {
        Name: 'ادرم',
    },
    {
        Name: 'ادريس',
    },
    {
        Name: 'ادغم',
    },
    {
        Name: 'ادلم',
    },
    {
        Name: 'ادم',
    },
    {
        Name: 'ادهم',
    },
    {
        Name: 'اديب',
    },
    {
        Name: 'اربد',
    },
    {
        Name: 'ارجح',
    },
    {
        Name: 'ارجوان',
    },
    {
        Name: 'ارحب',
    },
    {
        Name: 'ارحم',
    },
    {
        Name: 'ارسلان',
    },
    {
        Name: 'ارشد',
    },
    {
        Name: 'ارغد',
    },
    {
        Name: 'ارقم',
    },
    {
        Name: 'اركان',
    },
    {
        Name: 'اريج',
    },
    {
        Name: 'ازهد',
    },
    {
        Name: 'ازهر',
    },
    {
        Name: 'اسامة',
    },
    {
        Name: 'اسحاق',
    },
    {
        Name: 'اسد',
    },
    {
        Name: 'اسر',
    },
    {
        Name: 'اسعد',
    },
    {
        Name: 'اسلع',
    },
    {
        Name: 'اسلم',
    },
    {
        Name: 'اسماعيل',
    },
    {
        Name: 'اسمح',
    },
    {
        Name: 'اسهم',
    },
    {
        Name: 'اسيد',
    },
    {
        Name: 'اشرف',
    },
    {
        Name: 'اشهم',
    },
    {
        Name: 'اصلان',
    },
    {
        Name: 'اعجاز',
    },
    {
        Name: 'اعز',
    },
    {
        Name: 'اغلب',
    },
    {
        Name: 'افخر',
    },
    {
        Name: 'افخم',
    },
    {
        Name: 'افصح',
    },
    {
        Name: 'افضل',
    },
    {
        Name: 'افقه',
    },
    {
        Name: 'افكه',
    },
    {
        Name: 'افكه',
    },
    {
        Name: 'اكثم',
    },
    {
        Name: 'اكرم',
    },
    {
        Name: 'اكليل',
    },
    {
        Name: 'اكمل',
    },
    {
        Name: 'الفي',
    },
    {
        Name: 'المع',
    },
    {
        Name: 'المعي',
    },
    {
        Name: 'الياس',
    },
    {
        Name: 'اليف',
    },
    {
        Name: 'اماثل',
    },
    {
        Name: 'امام',
    },
    {
        Name: 'امجد',
    },
    {
        Name: 'امية',
    },
    {
        Name: 'امير',
    },
    {
        Name: 'امين',
    },
    {
        Name: 'انجب',
    },
    {
        Name: 'انجح',
    },
    {
        Name: 'انس',
    },
    {
        Name: 'انف',
    },
    {
        Name: 'انوار',
    },
    {
        Name: 'انور',
    },
    {
        Name: 'انوس',
    },
    {
        Name: 'انيس',
    },
    {
        Name: 'اهيف',
    },
    {
        Name: 'اهيم',
    },
    {
        Name: 'اوس',
    },
    {
        Name: 'اويس',
    },
    {
        Name: 'اياس',
    },
    {
        Name: 'ايمان',
    },
    {
        Name: 'ايهاب',
    },
    {
        Name: 'ايهم',
    },
    {
        Name: 'ايوب',
    },
    {
        Name: 'بادي',
    },
    {
        Name: 'باذخ',
    },
    {
        Name: 'بارح',
    },
    {
        Name: 'بارع',
    },
    {
        Name: 'بارق',
    },
    {
        Name: 'باسق',
    },
    {
        Name: 'باسل',
    },
    {
        Name: 'باسم',
    },
    {
        Name: 'باشر',
    },
    {
        Name: 'باشق',
    },
    {
        Name: 'باقر',
    },
    {
        Name: 'باقي',
    },
    {
        Name: 'باكر',
    },
    {
        Name: 'باهر',
    },
    {
        Name: 'باهي',
    },
    {
        Name: 'بُحتري',
    },
    {
        Name: 'بحر',
    },
    {
        Name: 'بحري',
    },
    {
        Name: 'بُحير',
    },
    {
        Name: 'بُحيرا',
    },
    {
        Name: 'بدر',
    },
    {
        Name: 'بدران',
    },
    {
        Name: 'بدري',
    },
    {
        Name: 'بدوي',
    },
    {
        Name: 'بدير',
    },
    {
        Name: 'بديل',
    },
    {
        Name: 'براء',
    },
    {
        Name: 'بّراق',
    },
    {
        Name: 'بُرد',
    },
    {
        Name: 'بركات',
    },
    {
        Name: 'برهان',
    },
    {
        Name: 'بريء',
    },
    {
        Name: 'بزاز',
    },
    {
        Name: 'بسام',
    },
    {
        Name: 'بُسر',
    },
    {
        Name: 'بسطام',
    },
    {
        Name: 'بسمان',
    },
    {
        Name: 'بسيط',
    },
    {
        Name: 'بسيم',
    },
    {
        Name: 'بشار',
    },
    {
        Name: 'بشارة',
    },
    {
        Name: 'بشاش',
    },
    {
        Name: 'بشر',
    },
    {
        Name: 'بشوش',
    },
    {
        Name: 'بشير',
    },
    {
        Name: 'بصير',
    },
    {
        Name: 'بطاح',
    },
    {
        Name: 'بكار',
    },
    {
        Name: 'بكر',
    },
    {
        Name: 'بكري',
    },
    {
        Name: 'بلال',
    },
    {
        Name: 'بلبل',
    },
    {
        Name: 'بلسم',
    },
    {
        Name: 'بلقان',
    },
    {
        Name: 'بليغ',
    },
    {
        Name: 'بنان',
    },
    {
        Name: 'بندر',
    },
    {
        Name: 'بهاء',
    },
    {
        Name: 'بهائي',
    },
    {
        Name: 'بهلول',
    },
    {
        Name: 'بهي',
    },
    {
        Name: 'بهيج',
    },
    {
        Name: 'تائب',
    },
    {
        Name: 'تابع',
    },
    {
        Name: 'تاج',
    },
    {
        Name: 'تاجي',
    },
    {
        Name: 'تالد',
    },
    {
        Name: 'تامر',
    },
    {
        Name: 'تبع',
    },
    {
        Name: 'تحسين',
    },
    {
        Name: 'تحفة',
    },
    {
        Name: 'تركي',
    },
    {
        Name: 'تغلب',
    },
    {
        Name: 'تقي',
    },
    {
        Name: 'تلال',
    },
    {
        Name: 'تليد',
    },
    {
        Name: 'تمام',
    },
    {
        Name: 'تميم',
    },
    {
        Name: 'تهامي',
    },
    {
        Name: 'توبة',
    },
    {
        Name: 'توقيق',
    },
    {
        Name: 'تيسير',
    },
    {
        Name: 'تيمور',
    },
    {
        Name: 'ثائر',
    },
    {
        Name: 'ثابت',
    },
    {
        Name: 'ثاني',
    },
    {
        Name: 'ثري',
    },
    {
        Name: 'ثقيف',
    },
    {
        Name: 'ثمود',
    },
    {
        Name: 'ثمين',
    },
    {
        Name: 'ثوّاب',
    },
    {
        Name: 'ثوابالله',
    },
    {
        Name: 'جائر',
    },
    {
        Name: 'جارم',
    },
    {
        Name: 'جازم',
    },
    {
        Name: 'جاسر',
    },
    {
        Name: 'جاسم',
    },
    {
        Name: 'جامع',
    },
    {
        Name: 'جاهد',
    },
    {
        Name: 'جاويد',
    },
    {
        Name: 'جبري',
    },
    {
        Name: 'جبل',
    },
    {
        Name: 'جبير',
    },
    {
        Name: 'جدول',
    },
    {
        Name: 'جدير',
    },
    {
        Name: 'جرهم',
    },
    {
        Name: 'جروان',
    },
    {
        Name: 'جرير',
    },
    {
        Name: 'جعفر',
    },
    {
        Name: 'جلا',
    },
    {
        Name: 'جلال',
    },
    {
        Name: 'جلوان',
    },
    {
        Name: 'جليس',
    },
    {
        Name: 'جليل',
    },
    {
        Name: 'جمال',
    },
    {
        Name: 'جمال',
    },
    {
        Name: 'جمعة',
    },
    {
        Name: 'جموح',
    },
    {
        Name: 'جميل',
    },
    {
        Name: 'جناد',
    },
    {
        Name: 'جندب',
    },
    {
        Name: 'جنيد',
    },
    {
        Name: 'جهاد',
    },
    {
        Name: 'حائم',
    },
    {
        Name: 'حاتم',
    },
    {
        Name: 'حادر',
    },
    {
        Name: 'حاذق',
    },
    {
        Name: 'حارث',
    },
    {
        Name: 'حارث',
    },
    {
        Name: 'حارثة',
    },
    {
        Name: 'حارثة',
    },
    {
        Name: 'حارس',
    },
    {
        Name: 'حازر',
    },
    {
        Name: 'حازر',
    },
    {
        Name: 'حازم',
    },
    {
        Name: 'حازم',
    },
    {
        Name: 'حاسب',
    },
    {
        Name: 'حاسم',
    },
    {
        Name: 'حاشد',
    },
    {
        Name: 'حاطب',
    },
    {
        Name: 'حافظ',
    },
    {
        Name: 'حافل',
    },
    {
        Name: 'حاكم',
    },
    {
        Name: 'حام',
    },
    {
        Name: 'حامد',
    },
    {
        Name: 'حامز',
    },
    {
        Name: 'حباب',
    },
    {
        Name: 'حبان',
    },
    {
        Name: 'حبيب',
    },
    {
        Name: 'حبيش',
    },
    {
        Name: 'حجاج',
    },
    {
        Name: 'حديج',
    },
    {
        Name: 'حديد',
    },
    {
        Name: 'حدير',
    },
    {
        Name: 'حذيفة',
    },
    {
        Name: 'حرملة',
    },
    {
        Name: 'حريث',
    },
    {
        Name: 'حريز',
    },
    {
        Name: 'حزام',
    },
    {
        Name: 'حزم',
    },
    {
        Name: 'حسام',
    },
    {
        Name: 'حسان',
    },
    {
        Name: 'حسني',
    },
    {
        Name: 'حسيب',
    },
    {
        Name: 'حشيم',
    },
    {
        Name: 'حصني',
    },
    {
        Name: 'حصين',
    },
    {
        Name: 'حضور',
    },
    {
        Name: 'حفي',
    },
    {
        Name: 'حفيد',
    },
    {
        Name: 'حقي',
    },
    {
        Name: 'حقيقي',
    },
    {
        Name: 'حكم',
    },
    {
        Name: 'حكمة',
    },
    {
        Name: 'حلال',
    },
    {
        Name: 'حليل',
    },
    {
        Name: 'حماد',
    },
    {
        Name: 'حمال',
    },
    {
        Name: 'حمدون',
    },
    {
        Name: 'حمزة',
    },
    {
        Name: 'حمودة',
    },
    {
        Name: 'حميدو',
    },
    {
        Name: 'حنيف',
    },
    {
        Name: 'حوريث',
    },
    {
        Name: 'حياتي',
    },
    {
        Name: 'حيدر',
    },
    {
        Name: 'خاتم',
    },
    {
        Name: 'خادر',
    },
    {
        Name: 'خارجة',
    },
    {
        Name: 'خازم',
    },
    {
        Name: 'خازن',
    },
    {
        Name: 'خاشع',
    },
    {
        Name: 'خاطب',
    },
    {
        Name: 'خاطر',
    },
    {
        Name: 'خاطر',
    },
    {
        Name: 'خافق',
    },
    {
        Name: 'خالد',
    },
    {
        Name: 'خالص',
    },
    {
        Name: 'خباب',
    },
    {
        Name: 'خبير',
    },
    {
        Name: 'خديج',
    },
    {
        Name: 'خريم',
    },
    {
        Name: 'خزاعي',
    },
    {
        Name: 'خزام',
    },
    {
        Name: 'خصي',
    },
    {
        Name: 'خضر',
    },
    {
        Name: 'خضير',
    },
    {
        Name: 'خطاب',
    },
    {
        Name: 'خطار',
    },
    {
        Name: 'خطير',
    },
    {
        Name: 'خفاجة',
    },
    {
        Name: 'خفير',
    },
    {
        Name: 'خفيف',
    },
    {
        Name: 'خلاد',
    },
    {
        Name: 'خلدون',
    },
    {
        Name: 'خلف',
    },
    {
        Name: 'خلوصي',
    },
    {
        Name: 'خلوق',
    },
    {
        Name: 'خليفة',
    },
    {
        Name: 'خليل',
    },
    {
        Name: 'خمير',
    },
    {
        Name: 'خميس',
    },
    {
        Name: 'خويلد',
    },
    {
        Name: 'خيالي',
    },
    {
        Name: 'خيثم',
    },
    {
        Name: 'خير',
    },
    {
        Name: 'خيري',
    },
    {
        Name: 'دؤوب',
    },
    {
        Name: 'دائب',
    },
    {
        Name: 'دائم',
    },
    {
        Name: 'دارج',
    },
    {
        Name: 'دارع',
    },
    {
        Name: 'داري',
    },
    {
        Name: 'داغر',
    },
    {
        Name: 'دامث',
    },
    {
        Name: 'دامس',
    },
    {
        Name: 'داني',
    },
    {
        Name: 'دانيال',
    },
    {
        Name: 'داهش',
    },
    {
        Name: 'داهي',
    },
    {
        Name: 'داوود',
    },
    {
        Name: 'دباح',
    },
    {
        Name: 'دحام',
    },
    {
        Name: 'دحلان',
    },
    {
        Name: 'دحية',
    },
    {
        Name: 'دحيم',
    },
    {
        Name: 'در',
    },
    {
        Name: 'درار',
    },
    {
        Name: 'دراك',
    },
    {
        Name: 'درباس',
    },
    {
        Name: 'درع',
    },
    {
        Name: 'درغام',
    },
    {
        Name: 'درويش',
    },
    {
        Name: 'دري',
    },
    {
        Name: 'دريب',
    },
    {
        Name: 'دريد',
    },
    {
        Name: 'درير',
    },
    {
        Name: 'دعاس',
    },
    {
        Name: 'دعيج',
    },
    {
        Name: 'دفاع',
    },
    {
        Name: 'دفاع',
    },
    {
        Name: 'دلامة',
    },
    {
        Name: 'دلف',
    },
    {
        Name: 'دلوف',
    },
    {
        Name: 'دليف',
    },
    {
        Name: 'دليل',
    },
    {
        Name: 'دهمان',
    },
    {
        Name: 'دهير',
    },
    {
        Name: 'دهيم',
    },
    {
        Name: 'دوسر',
    },
    {
        Name: 'دياب',
    },
    {
        Name: 'ديان',
    },
    {
        Name: 'ديب',
    },
    {
        Name: 'ديسق',
    },
    {
        Name: 'ذؤيب',
    },
    {
        Name: 'ذائد',
    },
    {
        Name: 'ذائق',
    },
    {
        Name: 'ذاتي',
    },
    {
        Name: 'ذاخر',
    },
    {
        Name: 'ذروة',
    },
    {
        Name: 'ذكوان',
    },
    {
        Name: 'ذكي',
    },
    {
        Name: 'ذليق',
    },
    {
        Name: 'ذمام',
    },
    {
        Name: 'ذمة',
    },
    {
        Name: 'ذمر',
    },
    {
        Name: 'ذهل',
    },
    {
        Name: 'ذهني',
    },
    {
        Name: 'ذهيل',
    },
    {
        Name: 'ذهين',
    },
    {
        Name: 'ذوالفقار',
    },
    {
        Name: 'ذيبان',
    },
    {
        Name: 'رؤوف',
    },
    {
        Name: 'رؤوف',
    },
    {
        Name: 'رئال',
    },
    {
        Name: 'رئبال',
    },
    {
        Name: 'رئيف',
    },
    {
        Name: 'رئيف',
    },
    {
        Name: 'رائب',
    },
    {
        Name: 'رائد',
    },
    {
        Name: 'رائع',
    },
    {
        Name: 'رائف',
    },
    {
        Name: 'رائف',
    },
    {
        Name: 'رائق',
    },
    {
        Name: 'رابح',
    },
    {
        Name: 'رابي',
    },
    {
        Name: 'راتب',
    },
    {
        Name: 'راتق',
    },
    {
        Name: 'راثد',
    },
    {
        Name: 'راجح',
    },
    {
        Name: 'راجي',
    },
    {
        Name: 'راحب',
    },
    {
        Name: 'راحم',
    },
    {
        Name: 'رادس',
    },
    {
        Name: 'رادع',
    },
    {
        Name: 'رادن',
    },
    {
        Name: 'رازح',
    },
    {
        Name: 'رازم',
    },
    {
        Name: 'راسخ',
    },
    {
        Name: 'راسم',
    },
    {
        Name: 'راشد',
    },
    {
        Name: 'راضي',
    },
    {
        Name: 'راعي',
    },
    {
        Name: 'راغب',
    },
    {
        Name: 'راغد',
    },
    {
        Name: 'رافة',
    },
    {
        Name: 'رافد',
    },
    {
        Name: 'رافغ',
    },
    {
        Name: 'رافي',
    },
    {
        Name: 'راقب',
    },
    {
        Name: 'راقم',
    },
    {
        Name: 'راكد',
    },
    {
        Name: 'راكز',
    },
    {
        Name: 'راكن',
    },
    {
        Name: 'رامح',
    },
    {
        Name: 'رامش',
    },
    {
        Name: 'رامق',
    },
    {
        Name: 'رامي',
    },
    {
        Name: 'راني',
    },
    {
        Name: 'راهف',
    },
    {
        Name: 'راهي',
    },
    {
        Name: 'راية',
    },
    {
        Name: 'رايج',
    },
    {
        Name: 'رباح',
    },
    {
        Name: 'ربان',
    },
    {
        Name: 'ربحي',
    },
    {
        Name: 'ربعة',
    },
    {
        Name: 'ربيح',
    },
    {
        Name: 'ربيز',
    },
    {
        Name: 'ربيع',
    },
    {
        Name: 'ربيعة',
    },
    {
        Name: 'رتيب',
    },
    {
        Name: 'رتيم',
    },
    {
        Name: 'رجائي',
    },
    {
        Name: 'رجب',
    },
    {
        Name: 'رجوان',
    },
    {
        Name: 'رجيح',
    },
    {
        Name: 'رحال',
    },
    {
        Name: 'رحيل',
    },
    {
        Name: 'رخيم',
    },
    {
        Name: 'ردمان',
    },
    {
        Name: 'رديف',
    },
    {
        Name: 'ردين',
    },
    {
        Name: 'رزام',
    },
    {
        Name: 'رزان',
    },
    {
        Name: 'رزيح',
    },
    {
        Name: 'رزيم',
    },
    {
        Name: 'رستم',
    },
    {
        Name: 'رسمي',
    },
    {
        Name: 'رسول',
    },
    {
        Name: 'رسيم',
    },
    {
        Name: 'رشاد',
    },
    {
        Name: 'رشادي',
    },
    {
        Name: 'رشد',
    },
    {
        Name: 'رشيد',
    },
    {
        Name: 'رشيف',
    },
    {
        Name: 'رشيق',
    },
    {
        Name: 'رصين',
    },
    {
        Name: 'رضا',
    },
    {
        Name: 'رضائي',
    },
    {
        Name: 'رضوان',
    },
    {
        Name: 'رضى',
    },
    {
        Name: 'رغاب',
    },
    {
        Name: 'رغدان',
    },
    {
        Name: 'رغيد',
    },
    {
        Name: 'رفا',
    },
    {
        Name: 'رفاعة',
    },
    {
        Name: 'رفاعي',
    },
    {
        Name: 'رفعت',
    },
    {
        Name: 'رفقي',
    },
    {
        Name: 'رفيد',
    },
    {
        Name: 'رفيع',
    },
    {
        Name: 'رفيق',
    },
    {
        Name: 'رقيق',
    },
    {
        Name: 'رقيم',
    },
    {
        Name: 'ركان',
    },
    {
        Name: 'ركن',
    },
    {
        Name: 'ركين',
    },
    {
        Name: 'رماح',
    },
    {
        Name: 'رمحي',
    },
    {
        Name: 'رمزي',
    },
    {
        Name: 'رمضان',
    },
    {
        Name: 'رميح',
    },
    {
        Name: 'رميز',
    },
    {
        Name: 'رنيم',
    },
    {
        Name: 'رهان',
    },
    {
        Name: 'رهيب',
    },
    {
        Name: 'رهيد',
    },
    {
        Name: 'رهيف',
    },
    {
        Name: 'رهيم',
    },
    {
        Name: 'روح',
    },
    {
        Name: 'روحان',
    },
    {
        Name: 'رونق',
    },
    {
        Name: 'رياح',
    },
    {
        Name: 'ريادة',
    },
    {
        Name: 'رياض',
    },
    {
        Name: 'ريان',
    },
    {
        Name: 'ريس',
    },
    {
        Name: 'ريم',
    },
    {
        Name: 'زاجر',
    },
    {
        Name: 'زاجل',
    },
    {
        Name: 'زاخر',
    },
    {
        Name: 'زافر',
    },
    {
        Name: 'زاكي',
    },
    {
        Name: 'زاهد',
    },
    {
        Name: 'زاهر',
    },
    {
        Name: 'زاهل',
    },
    {
        Name: 'زاهي',
    },
    {
        Name: 'زايد',
    },
    {
        Name: 'زبير',
    },
    {
        Name: 'زجاج',
    },
    {
        Name: 'زجار',
    },
    {
        Name: 'زخر',
    },
    {
        Name: 'زخران',
    },
    {
        Name: 'زخرف',
    },
    {
        Name: 'زخري',
    },
    {
        Name: 'زعزع',
    },
    {
        Name: 'زعلول',
    },
    {
        Name: 'زعيم',
    },
    {
        Name: 'زفاف',
    },
    {
        Name: 'زفان',
    },
    {
        Name: 'زفر',
    },
    {
        Name: 'زكائي',
    },
    {
        Name: 'زكريا',
    },
    {
        Name: 'زكنون',
    },
    {
        Name: 'زكوان',
    },
    {
        Name: 'زكين',
    },
    {
        Name: 'زناد',
    },
    {
        Name: 'زنام',
    },
    {
        Name: 'زند',
    },
    {
        Name: 'زنكي',
    },
    {
        Name: 'زنيم',
    },
    {
        Name: 'زهد',
    },
    {
        Name: 'زهدي',
    },
    {
        Name: 'زهر',
    },
    {
        Name: 'زهران',
    },
    {
        Name: 'زهري',
    },
    {
        Name: 'زهوان',
    },
    {
        Name: 'زهي',
    },
    {
        Name: 'زهيد',
    },
    {
        Name: 'زهير',
    },
    {
        Name: 'زوار',
    },
    {
        Name: 'زوبعة',
    },
    {
        Name: 'زياد',
    },
    {
        Name: 'زيان',
    },
    {
        Name: 'زيد',
    },
    {
        Name: 'زيدان',
    },
    {
        Name: 'زيدوان',
    },
    {
        Name: 'زيدي',
    },
    {
        Name: 'زين',
    },
    {
        Name: 'زينالعابدين',
    },
    {
        Name: 'سائب',
    },
    {
        Name: 'سائد',
    },
    {
        Name: 'سائر',
    },
    {
        Name: 'سابغ',
    },
    {
        Name: 'سابق',
    },
    {
        Name: 'ساتر',
    },
    {
        Name: 'ساجع',
    },
    {
        Name: 'ساجي',
    },
    {
        Name: 'ساحق',
    },
    {
        Name: 'سادح',
    },
    {
        Name: 'سادن',
    },
    {
        Name: 'سارح',
    },
    {
        Name: 'ساري',
    },
    {
        Name: 'سارية',
    },
    {
        Name: 'ساطع',
    },
    {
        Name: 'ساعدة',
    },
    {
        Name: 'ساقي',
    },
    {
        Name: 'سالم',
    },
    {
        Name: 'سام',
    },
    {
        Name: 'سامد',
    },
    {
        Name: 'سامر',
    },
    {
        Name: 'سامع',
    },
    {
        Name: 'سامل',
    },
    {
        Name: 'ساهر',
    },
    {
        Name: 'ساهي',
    },
    {
        Name: 'سباء',
    },
    {
        Name: 'سباق',
    },
    {
        Name: 'سبع',
    },
    {
        Name: 'سبيع',
    },
    {
        Name: 'سجي',
    },
    {
        Name: 'سجيح',
    },
    {
        Name: 'سجيع',
    },
    {
        Name: 'سجيل',
    },
    {
        Name: 'سحمان',
    },
    {
        Name: 'سحيم',
    },
    {
        Name: 'سخاء',
    },
    {
        Name: 'سخائي',
    },
    {
        Name: 'سخي',
    },
    {
        Name: 'سَدّاد',
    },
    {
        Name: 'سِدَاد',
    },
    {
        Name: 'سديد',
    },
    {
        Name: 'سدير',
    },
    {
        Name: 'سديف',
    },
    {
        Name: 'سديل',
    },
    {
        Name: 'سديم',
    },
    {
        Name: 'سراج',
    },
    {
        Name: 'سرحان',
    },
    {
        Name: 'سرمد',
    },
    {
        Name: 'سرور',
    },
    {
        Name: 'سُرَّي',
    },
    {
        Name: 'سرياح',
    },
    {
        Name: 'سريع',
    },
    {
        Name: 'سَطَّام',
    },
    {
        Name: 'سِطَّام',
    },
    {
        Name: 'سطوة',
    },
    {
        Name: 'سطيح',
    },
    {
        Name: 'سعد',
    },
    {
        Name: 'سعدالله',
    },
    {
        Name: 'سعدو',
    },
    {
        Name: 'سعدون',
    },
    {
        Name: 'سعدي',
    },
    {
        Name: 'سعفة',
    },
    {
        Name: 'سعود',
    },
    {
        Name: 'سعيد',
    },
    {
        Name: 'سفدان',
    },
    {
        Name: 'سفدان',
    },
    {
        Name: 'سفدان',
    },
    {
        Name: 'سفيان',
    },
    {
        Name: 'سفيان',
    },
    {
        Name: 'سفيان',
    },
    {
        Name: 'سفيد',
    },
    {
        Name: 'سفيد',
    },
    {
        Name: 'سفيد',
    },
    {
        Name: 'سفيع',
    },
    {
        Name: 'سفينة',
    },
    {
        Name: 'سكرية',
    },
    {
        Name: 'سكرية',
    },
    {
        Name: 'سلاف',
    },
    {
        Name: 'سلام',
    },
    {
        Name: 'سلام',
    },
    {
        Name: 'سلامة',
    },
    {
        Name: 'سلامي',
    },
    {
        Name: 'سلطان',
    },
    {
        Name: 'سلفة',
    },
    {
        Name: 'سلم',
    },
    {
        Name: 'سلمان',
    },
    {
        Name: 'سلمة',
    },
    {
        Name: 'سليك',
    },
    {
        Name: 'سليمان',
    },
    {
        Name: 'سماح',
    },
    {
        Name: 'سمعان',
    },
    {
        Name: 'سموح',
    },
    {
        Name: 'سمير',
    },
    {
        Name: 'سنبل',
    },
    {
        Name: 'سني',
    },
    {
        Name: 'سهران',
    },
    {
        Name: 'سهل',
    },
    {
        Name: 'سهلان',
    },
    {
        Name: 'سهيل',
    },
    {
        Name: 'سوار',
    },
    {
        Name: 'سوسان',
    },
    {
        Name: 'سويد',
    },
    {
        Name: 'سيار',
    },
    {
        Name: 'سيد',
    },
    {
        Name: 'سيران',
    },
    {
        Name: 'سيف',
    },
    {
        Name: 'شادن',
    },
    {
        Name: 'شادي',
    },
    {
        Name: 'شارح',
    },
    {
        Name: 'شارد',
    },
    {
        Name: 'شاطر',
    },
    {
        Name: 'شافع',
    },
    {
        Name: 'شافعي',
    },
    {
        Name: 'شافي',
    },
    {
        Name: 'شاكر',
    },
    {
        Name: 'شامخ',
    },
    {
        Name: 'شامل',
    },
    {
        Name: 'شاهب',
    },
    {
        Name: 'شاهد',
    },
    {
        Name: 'شاهر',
    },
    {
        Name: 'شاهق',
    },
    {
        Name: 'شاهي',
    },
    {
        Name: 'شاهين',
    },
    {
        Name: 'شاور',
    },
    {
        Name: 'شبابة',
    },
    {
        Name: 'شبام',
    },
    {
        Name: 'شبعان',
    },
    {
        Name: 'شبل',
    },
    {
        Name: 'شبلي',
    },
    {
        Name: 'شبيب',
    },
    {
        Name: 'شتيوي',
    },
    {
        Name: 'شجاع',
    },
    {
        Name: 'شجيع',
    },
    {
        Name: 'شجيع',
    },
    {
        Name: 'شداد',
    },
    {
        Name: 'شديد',
    },
    {
        Name: 'شراع',
    },
    {
        Name: 'شرحبيل',
    },
    {
        Name: 'شرف',
    },
    {
        Name: 'شريح',
    },
    {
        Name: 'شريد',
    },
    {
        Name: 'شريف',
    },
    {
        Name: 'شعار',
    },
    {
        Name: 'شعاع',
    },
    {
        Name: 'شعبان',
    },
    {
        Name: 'شعبة',
    },
    {
        Name: 'شعل',
    },
    {
        Name: 'شعلة',
    },
    {
        Name: 'شعيب',
    },
    {
        Name: 'شفوق',
    },
    {
        Name: 'شفيع',
    },
    {
        Name: 'شفيق',
    },
    {
        Name: 'شقران',
    },
    {
        Name: 'شقيق',
    },
    {
        Name: 'شكران',
    },
    {
        Name: 'شكري',
    },
    {
        Name: 'شكور',
    },
    {
        Name: 'شكيب',
    },
    {
        Name: 'شكيم',
    },
    {
        Name: 'شلال',
    },
    {
        Name: 'شماخ',
    },
    {
        Name: 'شماس',
    },
    {
        Name: 'شمدين',
    },
    {
        Name: 'شمروخ',
    },
    {
        Name: 'شمرول',
    },
    {
        Name: 'شمس',
    },
    {
        Name: 'شمسي',
    },
    {
        Name: 'شمعة',
    },
    {
        Name: 'شموخ',
    },
    {
        Name: 'شمول',
    },
    {
        Name: 'شميل',
    },
    {
        Name: 'شهاب',
    },
    {
        Name: 'شهامة',
    },
    {
        Name: 'شهد',
    },
    {
        Name: 'شهدان',
    },
    {
        Name: 'شهدي',
    },
    {
        Name: 'شهرور',
    },
    {
        Name: 'شهل',
    },
    {
        Name: 'شهم',
    },
    {
        Name: 'شهوان',
    },
    {
        Name: 'شهيد',
    },
    {
        Name: 'شهير',
    },
    {
        Name: 'شهيم',
    },
    {
        Name: 'شوقي',
    },
    {
        Name: 'شوكة',
    },
    {
        Name: 'شيبان',
    },
    {
        Name: 'شيحان',
    },
    {
        Name: 'شيخان',
    },
    {
        Name: 'صائب',
    },
    {
        Name: 'صائم',
    },
    {
        Name: 'صائن',
    },
    {
        Name: 'صابر',
    },
    {
        Name: 'صاحب',
    },
    {
        Name: 'صاحي',
    },
    {
        Name: 'صادح',
    },
    {
        Name: 'صادع',
    },
    {
        Name: 'صادق',
    },
    {
        Name: 'صارد',
    },
    {
        Name: 'صارم',
    },
    {
        Name: 'صاعد',
    },
    {
        Name: 'صافي',
    },
    {
        Name: 'صالح',
    },
    {
        Name: 'صامد',
    },
    {
        Name: 'صبا',
    },
    {
        Name: 'صباح',
    },
    {
        Name: 'صباحي',
    },
    {
        Name: 'صبري',
    },
    {
        Name: 'صبوح',
    },
    {
        Name: 'صبور',
    },
    {
        Name: 'صبيح',
    },
    {
        Name: 'صحار',
    },
    {
        Name: 'صخر',
    },
    {
        Name: 'صداح',
    },
    {
        Name: 'صدام',
    },
    {
        Name: 'صدقي',
    },
    {
        Name: 'صدوح',
    },
    {
        Name: 'صدوق',
    },
    {
        Name: 'صديق',
    },
    {
        Name: 'صراح',
    },
    {
        Name: 'صريح',
    },
    {
        Name: 'صعب',
    },
    {
        Name: 'صعود',
    },
    {
        Name: 'صفا',
    },
    {
        Name: 'صفائي',
    },
    {
        Name: 'صفوان',
    },
    {
        Name: 'صفوة',
    },
    {
        Name: 'صفوح',
    },
    {
        Name: 'صفي',
    },
    {
        Name: 'صلاح',
    },
    {
        Name: 'صلحي',
    },
    {
        Name: 'صميم',
    },
    {
        Name: 'صنديد',
    },
    {
        Name: 'صنوان',
    },
    {
        Name: 'صهبان',
    },
    {
        Name: 'صهيب',
    },
    {
        Name: 'صواب',
    },
    {
        Name: 'صوابي',
    },
    {
        Name: 'صوان',
    },
    {
        Name: 'صولة',
    },
    {
        Name: 'صوى',
    },
    {
        Name: 'صويلح',
    },
    {
        Name: 'صياح',
    },
    {
        Name: 'صيدح',
    },
    {
        Name: 'ضاحك',
    },
    {
        Name: 'ضاحي',
    },
    {
        Name: 'ضارع',
    },
    {
        Name: 'ضاري',
    },
    {
        Name: 'ضامر',
    },
    {
        Name: 'ضامن',
    },
    {
        Name: 'ضاهر',
    },
    {
        Name: 'ضاوي',
    },
    {
        Name: 'ضبير',
    },
    {
        Name: 'ضحاك',
    },
    {
        Name: 'ضرار',
    },
    {
        Name: 'ضرغام',
    },
    {
        Name: 'ضياء',
    },
    {
        Name: 'ضياف',
    },
    {
        Name: 'ضيغم',
    },
    {
        Name: 'طائع',
    },
    {
        Name: 'طارق',
    },
    {
        Name: 'طالب',
    },
    {
        Name: 'طالع',
    },
    {
        Name: 'طامح',
    },
    {
        Name: 'طاهر',
    },
    {
        Name: 'طاووس',
    },
    {
        Name: 'طراد',
    },
    {
        Name: 'طرفة',
    },
    {
        Name: 'طروق',
    },
    {
        Name: 'طريف',
    },
    {
        Name: 'طفاح',
    },
    {
        Name: 'طفيف',
    },
    {
        Name: 'طفيل',
    },
    {
        Name: 'طلاب',
    },
    {
        Name: 'طلال',
    },
    {
        Name: 'طلبة',
    },
    {
        Name: 'طلحة',
    },
    {
        Name: 'طلق',
    },
    {
        Name: 'طموح',
    },
    {
        Name: 'طه',
    },
    {
        Name: 'طهور',
    },
    {
        Name: 'طهير',
    },
    {
        Name: 'طواف',
    },
    {
        Name: 'طيب',
    },
    {
        Name: 'ظافر',
    },
    {
        Name: 'ظالم',
    },
    {
        Name: 'ظاهر',
    },
    {
        Name: 'ظبيان',
    },
    {
        Name: 'ظريف',
    },
    {
        Name: 'ظفار',
    },
    {
        Name: 'ظفر',
    },
    {
        Name: 'ظفير',
    },
    {
        Name: 'ظلال',
    },
    {
        Name: 'ظلام',
    },
    {
        Name: 'ظلوم',
    },
    {
        Name: 'ظليل',
    },
    {
        Name: 'ظهور',
    },
    {
        Name: 'ظهير',
    },
    {
        Name: 'عائد',
    },
    {
        Name: 'عابد',
    },
    {
        Name: 'عابدين',
    },
    {
        Name: 'عابر',
    },
    {
        Name: 'عاتك',
    },
    {
        Name: 'عاجب',
    },
    {
        Name: 'عاجل',
    },
    {
        Name: 'عاد',
    },
    {
        Name: 'عادل',
    },
    {
        Name: 'عادن',
    },
    {
        Name: 'عادي',
    },
    {
        Name: 'عاذر',
    },
    {
        Name: 'عارف',
    },
    {
        Name: 'عارم',
    },
    {
        Name: 'عازم',
    },
    {
        Name: 'عاشر',
    },
    {
        Name: 'عاشق',
    },
    {
        Name: 'عاشور',
    },
    {
        Name: 'عاصف',
    },
    {
        Name: 'عاصم',
    },
    {
        Name: 'عاصي',
    },
    {
        Name: 'عاطر',
    },
    {
        Name: 'عاطف',
    },
    {
        Name: 'عافي',
    },
    {
        Name: 'عاقل',
    },
    {
        Name: 'عاكف',
    },
    {
        Name: 'عالم',
    },
    {
        Name: 'عالي',
    },
    {
        Name: 'عامر',
    },
    {
        Name: 'عامل',
    },
    {
        Name: 'عاهد',
    },
    {
        Name: 'عايد',
    },
    {
        Name: 'عايش',
    },
    {
        Name: 'عايق',
    },
    {
        Name: 'عبد',
    },
    {
        Name: 'عبدالبارئ',
    },
    {
        Name: 'عبدالباسط',
    },
    {
        Name: 'عبدالباقي',
    },
    {
        Name: 'عبدالبديع',
    },
    {
        Name: 'عبدالبصير',
    },
    {
        Name: 'عبدالتواب',
    },
    {
        Name: 'عبدالجبار',
    },
    {
        Name: 'عبدالجليل',
    },
    {
        Name: 'عبدالحسيب',
    },
    {
        Name: 'عبدالحفيظ',
    },
    {
        Name: 'عبدالحق',
    },
    {
        Name: 'عبدالحكم',
    },
    {
        Name: 'عبدالحكيم',
    },
    {
        Name: 'عبدالحليم',
    },
    {
        Name: 'عبدالحي',
    },
    {
        Name: 'عبدالخالق',
    },
    {
        Name: 'عبدالرافع',
    },
    {
        Name: 'عبدالرحمن',
    },
    {
        Name: 'عبدالرحيم',
    },
    {
        Name: 'عبدالرزاق',
    },
    {
        Name: 'عبدالسلام',
    },
    {
        Name: 'عبدالسميع',
    },
    {
        Name: 'عبدالشكور',
    },
    {
        Name: 'عبدالصمد',
    },
    {
        Name: 'عبدالعزيز',
    },
    {
        Name: 'عبدالعظيم',
    },
    {
        Name: 'عبدالعليم',
    },
    {
        Name: 'عبدالغفار',
    },
    {
        Name: 'عبدالغفور',
    },
    {
        Name: 'عبدالغفور',
    },
    {
        Name: 'عبدالفتاح',
    },
    {
        Name: 'عبدالقابض',
    },
    {
        Name: 'عبدالقادر',
    },
    {
        Name: 'عبدالقدوس',
    },
    {
        Name: 'عبدالقهار',
    },
    {
        Name: 'عبدالكريم',
    },
    {
        Name: 'عبداللطيف',
    },
    {
        Name: 'عبدالله',
    },
    {
        Name: 'عبدالماجد',
    },
    {
        Name: 'عبدالمتكبر',
    },
    {
        Name: 'عبدالمتين',
    },
    {
        Name: 'عبدالمجيب',
    },
    {
        Name: 'عبدالمجيد',
    },
    {
        Name: 'عبدالمحيي',
    },
    {
        Name: 'عبدالمعز',
    },
    {
        Name: 'عبدالمقتدر',
    },
    {
        Name: 'عبدالمقدم',
    },
    {
        Name: 'عبدالملك',
    },
    {
        Name: 'عبدالمهيمن',
    },
    {
        Name: 'عبدالنور',
    },
    {
        Name: 'عبدالهادي',
    },
    {
        Name: 'عبدالواجد',
    },
    {
        Name: 'عبدالواحد',
    },
    {
        Name: 'عبدالوارث',
    },
    {
        Name: 'عبدالوالي',
    },
    {
        Name: 'عبدالودود',
    },
    {
        Name: 'عبدالوهّاب',
    },
    {
        Name: 'عتبة',
    },
    {
        Name: 'عدي',
    },
    {
        Name: 'عديل',
    },
    {
        Name: 'عرابة',
    },
    {
        Name: 'عرادة',
    },
    {
        Name: 'عراف',
    },
    {
        Name: 'عرفان',
    },
    {
        Name: 'عرفة',
    },
    {
        Name: 'عرندس',
    },
    {
        Name: 'عروة',
    },
    {
        Name: 'عريب',
    },
    {
        Name: 'عرين',
    },
    {
        Name: 'عز',
    },
    {
        Name: 'عزاز',
    },
    {
        Name: 'عزام',
    },
    {
        Name: 'عزت',
    },
    {
        Name: 'عزمي',
    },
    {
        Name: 'عزيز',
    },
    {
        Name: 'عساف',
    },
    {
        Name: 'عسوب',
    },
    {
        Name: 'عصام',
    },
    {
        Name: 'عصفور',
    },
    {
        Name: 'عطفي',
    },
    {
        Name: 'عظيم',
    },
    {
        Name: 'عفان',
    },
    {
        Name: 'عفير',
    },
    {
        Name: 'عفيف',
    },
    {
        Name: 'عقبة',
    },
    {
        Name: 'عقل',
    },
    {
        Name: 'عقيل',
    },
    {
        Name: 'عكاشة',
    },
    {
        Name: 'عكنان',
    },
    {
        Name: 'علاء',
    },
    {
        Name: 'علامة',
    },
    {
        Name: 'علم',
    },
    {
        Name: 'علوان',
    },
    {
        Name: 'عليان',
    },
    {
        Name: 'عماد',
    },
    {
        Name: 'عمار',
    },
    {
        Name: 'عمارة',
    },
    {
        Name: 'عمر',
    },
    {
        Name: 'عمران',
    },
    {
        Name: 'عميم',
    },
    {
        Name: 'عنتر',
    },
    {
        Name: 'عنترة',
    },
    {
        Name: 'عنين',
    },
    {
        Name: 'عهدي',
    },
    {
        Name: 'عون',
    },
    {
        Name: 'عياد',
    },
    {
        Name: 'عياش',
    },
    {
        Name: 'عيشي',
    },
    {
        Name: 'غادي',
    },
    {
        Name: 'غارس',
    },
    {
        Name: 'غازي',
    },
    {
        Name: 'غاسق',
    },
    {
        Name: 'غافق',
    },
    {
        Name: 'غالب',
    },
    {
        Name: 'غالي',
    },
    {
        Name: 'غامد',
    },
    {
        Name: 'غامر',
    },
    {
        Name: 'غانم',
    },
    {
        Name: 'غاني',
    },
    {
        Name: 'غاوي',
    },
    {
        Name: 'غتوان',
    },
    {
        Name: 'غدير',
    },
    {
        Name: 'غراب',
    },
    {
        Name: 'غراس',
    },
    {
        Name: 'غرام',
    },
    {
        Name: 'غريب',
    },
    {
        Name: 'غريد',
    },
    {
        Name: 'غريم',
    },
    {
        Name: 'غزال',
    },
    {
        Name: 'غزوان',
    },
    {
        Name: 'غزير',
    },
    {
        Name: 'غسان',
    },
    {
        Name: 'غصاب',
    },
    {
        Name: 'غصوب',
    },
    {
        Name: 'غضنفر',
    },
    {
        Name: 'غطفان',
    },
    {
        Name: 'غفار',
    },
    {
        Name: 'غلا',
    },
    {
        Name: 'غلاب',
    },
    {
        Name: 'غنوم',
    },
    {
        Name: 'غنيم',
    },
    {
        Name: 'غوار',
    },
    {
        Name: 'غياث',
    },
    {
        Name: 'غيهب',
    },
    {
        Name: 'فؤاد',
    },
    {
        Name: 'فائز',
    },
    {
        Name: 'فائق',
    },
    {
        Name: 'فاتح',
    },
    {
        Name: 'فاتك',
    },
    {
        Name: 'فاطن',
    },
    {
        Name: 'فالح',
    },
    {
        Name: 'فتحي',
    },
    {
        Name: 'فجري',
    },
    {
        Name: 'فخار',
    },
    {
        Name: 'فخامة',
    },
    {
        Name: 'فخري',
    },
    {
        Name: 'فخور',
    },
    {
        Name: 'فدائي',
    },
    {
        Name: 'فدعان',
    },
    {
        Name: 'فراس',
    },
    {
        Name: 'فرج',
    },
    {
        Name: 'فرحان',
    },
    {
        Name: 'فرحون',
    },
    {
        Name: 'فريد',
    },
    {
        Name: 'فريز',
    },
    {
        Name: 'فضل',
    },
    {
        Name: 'فناح',
    },
    {
        Name: 'فهد',
    },
    {
        Name: 'فهم',
    },
    {
        Name: 'فهمان',
    },
    {
        Name: 'فهمي',
    },
    {
        Name: 'فواز',
    },
    {
        Name: 'فوزي',
    },
    {
        Name: 'فياح',
    },
    {
        Name: 'فياض',
    },
    {
        Name: 'فيصل',
    },
    {
        Name: 'فيض',
    },
    {
        Name: 'فيضي',
    },
    {
        Name: 'فيلق',
    },
    {
        Name: 'قابس',
    },
    {
        Name: 'قابل',
    },
    {
        Name: 'قابوس',
    },
    {
        Name: 'قادر',
    },
    {
        Name: 'قادس',
    },
    {
        Name: 'قادم',
    },
    {
        Name: 'قارس',
    },
    {
        Name: 'قاسط',
    },
    {
        Name: 'قاسم',
    },
    {
        Name: 'قاصد',
    },
    {
        Name: 'قاطن',
    },
    {
        Name: 'قانت',
    },
    {
        Name: 'قانع',
    },
    {
        Name: 'قاني',
    },
    {
        Name: 'قاهي',
    },
    {
        Name: 'قبولي',
    },
    {
        Name: 'قتار',
    },
    {
        Name: 'قتبان',
    },
    {
        Name: 'قثم',
    },
    {
        Name: 'قدير',
    },
    {
        Name: 'قذيف',
    },
    {
        Name: 'قريب',
    },
    {
        Name: 'قرير',
    },
    {
        Name: 'قريش',
    },
    {
        Name: 'قصام',
    },
    {
        Name: 'قصي',
    },
    {
        Name: 'قطام',
    },
    {
        Name: 'قعقاع',
    },
    {
        Name: 'قليب',
    },
    {
        Name: 'قميط',
    },
    {
        Name: 'قنوان',
    },
    {
        Name: 'قنوت',
    },
    {
        Name: 'قنوع',
    },
    {
        Name: 'قنيع',
    },
    {
        Name: 'قوي',
    },
    {
        Name: 'قيس',
    },
    {
        Name: 'كائن',
    },
    {
        Name: 'كاتب',
    },
    {
        Name: 'كاتم',
    },
    {
        Name: 'كاثر',
    },
    {
        Name: 'كارم',
    },
    {
        Name: 'كاسب',
    },
    {
        Name: 'كاسر',
    },
    {
        Name: 'كاشف',
    },
    {
        Name: 'كاظم',
    },
    {
        Name: 'كاغد',
    },
    {
        Name: 'كافي',
    },
    {
        Name: 'كامل',
    },
    {
        Name: 'كامي',
    },
    {
        Name: 'كانز',
    },
    {
        Name: 'كانن',
    },
    {
        Name: 'كاهل',
    },
    {
        Name: 'كايد',
    },
    {
        Name: 'كتوم',
    },
    {
        Name: 'كثيب',
    },
    {
        Name: 'كحيل',
    },
    {
        Name: 'كرام',
    },
    {
        Name: 'كرز',
    },
    {
        Name: 'كرم',
    },
    {
        Name: 'كريم',
    },
    {
        Name: 'كساب',
    },
    {
        Name: 'كسوب',
    },
    {
        Name: 'كعب',
    },
    {
        Name: 'كفاح',
    },
    {
        Name: 'كليم',
    },
    {
        Name: 'كميت',
    },
    {
        Name: 'كنعان',
    },
    {
        Name: 'كنين',
    },
    {
        Name: 'كهل',
    },
    {
        Name: 'كهلان',
    },
    {
        Name: 'كوثر',
    },
    {
        Name: 'كيداد',
    },
    {
        Name: 'لؤي',
    },
    {
        Name: 'لاحظ',
    },
    {
        Name: 'لاحق',
    },
    {
        Name: 'لالا',
    },
    {
        Name: 'لامة',
    },
    {
        Name: 'لامح',
    },
    {
        Name: 'لامس',
    },
    {
        Name: 'لامع',
    },
    {
        Name: 'لاهز',
    },
    {
        Name: 'لايق',
    },
    {
        Name: 'لباب',
    },
    {
        Name: 'لبوان',
    },
    {
        Name: 'لبيب',
    },
    {
        Name: 'لبيد',
    },
    {
        Name: 'لجين',
    },
    {
        Name: 'لطافة',
    },
    {
        Name: 'لطفي',
    },
    {
        Name: 'لطوف',
    },
    {
        Name: 'لطيف',
    },
    {
        Name: 'لقيط',
    },
    {
        Name: 'لماح',
    },
    {
        Name: 'لميع',
    },
    {
        Name: 'لهيف',
    },
    {
        Name: 'لهيم',
    },
    {
        Name: 'لواء',
    },
    {
        Name: 'لوط',
    },
    {
        Name: 'ليث',
    },
    {
        Name: 'ليثي',
    },
    {
        Name: 'مائد',
    },
    {
        Name: 'ماثد',
    },
    {
        Name: 'ماجد',
    },
    {
        Name: 'مادح',
    },
    {
        Name: 'مادن',
    },
    {
        Name: 'مارد',
    },
    {
        Name: 'مارن',
    },
    {
        Name: 'مازن',
    },
    {
        Name: 'ماهي',
    },
    {
        Name: 'مايز',
    },
    {
        Name: 'مبادر',
    },
    {
        Name: 'مبارز',
    },
    {
        Name: 'مبارك',
    },
    {
        Name: 'مباشر',
    },
    {
        Name: 'مباهي',
    },
    {
        Name: 'مبتغي',
    },
    {
        Name: 'مبتهج',
    },
    {
        Name: 'مبجل',
    },
    {
        Name: 'مبرور',
    },
    {
        Name: 'مبروك',
    },
    {
        Name: 'مبسوط',
    },
    {
        Name: 'مبشر',
    },
    {
        Name: 'مبين',
    },
    {
        Name: 'متبسل',
    },
    {
        Name: 'متحد',
    },
    {
        Name: 'متروك',
    },
    {
        Name: 'متعب',
    },
    {
        Name: 'متمم',
    },
    {
        Name: 'متوكل',
    },
    {
        Name: 'متين',
    },
    {
        Name: 'مثبت',
    },
    {
        Name: 'مثلج',
    },
    {
        Name: 'مجاهد',
    },
    {
        Name: 'مجتبى',
    },
    {
        Name: 'مجير',
    },
    {
        Name: 'محمد',
    },
    {
        Name: 'محمود',
    },
    {
        Name: 'مخبر',
    },
    {
        Name: 'مختار',
    },
    {
        Name: 'مخدوم',
    },
    {
        Name: 'مخزوم',
    },
    {
        Name: 'مخلد',
    },
    {
        Name: 'مران',
    },
    {
        Name: 'مرتد',
    },
    {
        Name: 'مرجان',
    },
    {
        Name: 'مرداس',
    },
    {
        Name: 'نائل',
    },
    {
        Name: 'نابغ',
    },
    {
        Name: 'نابغة',
    },
    {
        Name: 'ناجح',
    },
    {
        Name: 'ناجي',
    },
    {
        Name: 'نادر',
    },
    {
        Name: 'ناشد',
    },
    {
        Name: 'ناصح',
    },
    {
        Name: 'ناصر',
    },
    {
        Name: 'ناظر',
    },
    {
        Name: 'ناظم',
    },
    {
        Name: 'نافل',
    },
    {
        Name: 'نامق',
    },
    {
        Name: 'ناهض',
    },
    {
        Name: 'نايف',
    },
    {
        Name: 'نبهان',
    },
    {
        Name: 'نبيل',
    },
    {
        Name: 'نبيه',
    },
    {
        Name: 'نجاتي',
    },
    {
        Name: 'نجل',
    },
    {
        Name: 'نجم',
    },
    {
        Name: 'نجيب',
    },
    {
        Name: 'نجيبالدين',
    },
    {
        Name: 'نجيع',
    },
    {
        Name: 'نديم',
    },
    {
        Name: 'نذير',
    },
    {
        Name: 'نزار',
    },
    {
        Name: 'نزيه',
    },
    {
        Name: 'نسر',
    },
    {
        Name: 'نسيب',
    },
    {
        Name: 'نسيم',
    },
    {
        Name: 'نشمي',
    },
    {
        Name: 'نصار',
    },
    {
        Name: 'نصر',
    },
    {
        Name: 'نصرالدين',
    },
    {
        Name: 'نصيب',
    },
    {
        Name: 'نصيرالدين',
    },
    {
        Name: 'نضال',
    },
    {
        Name: 'نضر',
    },
    {
        Name: 'نظام',
    },
    {
        Name: 'نعمان',
    },
    {
        Name: 'نعمةالله',
    },
    {
        Name: 'نعيم',
    },
    {
        Name: 'نعيمالدين',
    },
    {
        Name: 'نفوذ',
    },
    {
        Name: 'نفيس',
    },
    {
        Name: 'نفيع',
    },
    {
        Name: 'نقاء',
    },
    {
        Name: 'نمر',
    },
    {
        Name: 'نمير',
    },
    {
        Name: 'نهاد',
    },
    {
        Name: 'نواف',
    },
    {
        Name: 'نوح',
    },
    {
        Name: 'نور',
    },
    {
        Name: 'نور',
    },
    {
        Name: 'نورالحق',
    },
    {
        Name: 'نورالدين',
    },
    {
        Name: 'نورالله',
    },
    {
        Name: 'نوران',
    },
    {
        Name: 'نوفل',
    },
    {
        Name: 'نيزك',
    },
    {
        Name: 'هائل',
    },
    {
        Name: 'هائم',
    },
    {
        Name: 'هاجد',
    },
    {
        Name: 'هارون',
    },
    {
        Name: 'هرماس',
    },
    {
        Name: 'هصور',
    },
    {
        Name: 'هلاب',
    },
    {
        Name: 'هماس',
    },
    {
        Name: 'همام',
    },
    {
        Name: 'هواس',
    },
    {
        Name: 'هوام',
    },
    {
        Name: 'هيصر',
    },
    {
        Name: 'هيصم',
    },
    {
        Name: 'هيمان',
    },
    {
        Name: 'وابل',
    },
    {
        Name: 'واجد',
    },
    {
        Name: 'وادع',
    },
    {
        Name: 'وارع',
    },
    {
        Name: 'وارف',
    },
    {
        Name: 'واكف',
    },
    {
        Name: 'وجيه',
    },
    {
        Name: 'ورد',
    },
    {
        Name: 'وردان',
    },
    {
        Name: 'وسيم',
    },
    {
        Name: 'وليف',
    },
    {
        Name: 'يافع',
    },
    {
        Name: 'يامن',
    },
    {
        Name: 'يانع',
    },
    {
        Name: 'يحيى',
    },
    {
        Name: 'يقظان',
    },
    {
        Name: 'يمان',
    },
    {
        Name: 'ينيع',
    },
];

// set name
let name_field = document.querySelector('#name-field');

let name = array[getRandomArbitrary(0, array.length)].Name;

name_field.setAttribute('placeholder', name);

// set icon
let index = -1;
let icons = [
    'boar',
    'frog',
    'horse',
    'koala',
    'lion',
    'parrot',
    'pig',
    'rhino',
    'snake',
];
let icon = document.querySelector('#icon-container > img');
let reload = document.querySelector('#reload');
const resetIcon = () => {
    if (index != -1) {
        let firstIndex = getRandomArbitrary(0, index);
        let secondIndex = getRandomArbitrary(index + 1, 8);

        if (index == 0) {
            index = getRandomArbitrary(1, 8);
        } else {
            index = Math.random() < 0.5 ? firstIndex : secondIndex;
        }
    } else {
        index = getRandomArbitrary(0, 8);
    }

    icon.src = `./main/icons/${icons[index]}.png`;
};
resetIcon();
reload.addEventListener('click', () => {
    resetIcon();
});
